###################################################################

# Created by write_sdc on Thu Mar 21 17:54:15 2019

###################################################################
set sdc_version 1.8

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_wire_load_mode segmented
set_wire_load_model -name smic18_wl10 -library slow
set_max_transition 3 [current_design]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports clk]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports reset]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[31]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[30]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[29]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[28]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[27]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[26]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[25]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[24]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[23]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[22]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[21]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[20]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[19]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[18]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[17]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[16]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[15]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[14]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[13]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[12]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[11]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[10]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[9]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[8]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[7]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[6]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[5]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[4]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[3]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[2]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[1]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports {data[0]}]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports write_enable]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports last_block]
set_driving_cell -lib_cell PO8W -pin PAD [get_ports first_block]
set_load -pin_load 4.37 [get_ports busy]
set_load -pin_load 4.37 [get_ports {digest[7]}]
set_load -pin_load 4.37 [get_ports {digest[6]}]
set_load -pin_load 4.37 [get_ports {digest[5]}]
set_load -pin_load 4.37 [get_ports {digest[4]}]
set_load -pin_load 4.37 [get_ports {digest[3]}]
set_load -pin_load 4.37 [get_ports {digest[2]}]
set_load -pin_load 4.37 [get_ports {digest[1]}]
set_load -pin_load 4.37 [get_ports {digest[0]}]
set_load -pin_load 4.37 [get_ports output_enable]
set_ideal_network [get_ports reset]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_latency 0.3  [get_clocks clk]
set_clock_latency -source 4  [get_clocks clk]
set_clock_uncertainty 0.5  [get_clocks clk]
set_clock_transition -fall 0.2 [get_clocks clk]
set_clock_transition -rise 0.2 [get_clocks clk]
set_input_delay -clock clk  -max 5  [get_ports reset]
set_input_delay -clock clk  -max 5  [get_ports {data[31]}]
set_input_delay -clock clk  -max 5  [get_ports {data[30]}]
set_input_delay -clock clk  -max 5  [get_ports {data[29]}]
set_input_delay -clock clk  -max 5  [get_ports {data[28]}]
set_input_delay -clock clk  -max 5  [get_ports {data[27]}]
set_input_delay -clock clk  -max 5  [get_ports {data[26]}]
set_input_delay -clock clk  -max 5  [get_ports {data[25]}]
set_input_delay -clock clk  -max 5  [get_ports {data[24]}]
set_input_delay -clock clk  -max 5  [get_ports {data[23]}]
set_input_delay -clock clk  -max 5  [get_ports {data[22]}]
set_input_delay -clock clk  -max 5  [get_ports {data[21]}]
set_input_delay -clock clk  -max 5  [get_ports {data[20]}]
set_input_delay -clock clk  -max 5  [get_ports {data[19]}]
set_input_delay -clock clk  -max 5  [get_ports {data[18]}]
set_input_delay -clock clk  -max 5  [get_ports {data[17]}]
set_input_delay -clock clk  -max 5  [get_ports {data[16]}]
set_input_delay -clock clk  -max 5  [get_ports {data[15]}]
set_input_delay -clock clk  -max 5  [get_ports {data[14]}]
set_input_delay -clock clk  -max 5  [get_ports {data[13]}]
set_input_delay -clock clk  -max 5  [get_ports {data[12]}]
set_input_delay -clock clk  -max 5  [get_ports {data[11]}]
set_input_delay -clock clk  -max 5  [get_ports {data[10]}]
set_input_delay -clock clk  -max 5  [get_ports {data[9]}]
set_input_delay -clock clk  -max 5  [get_ports {data[8]}]
set_input_delay -clock clk  -max 5  [get_ports {data[7]}]
set_input_delay -clock clk  -max 5  [get_ports {data[6]}]
set_input_delay -clock clk  -max 5  [get_ports {data[5]}]
set_input_delay -clock clk  -max 5  [get_ports {data[4]}]
set_input_delay -clock clk  -max 5  [get_ports {data[3]}]
set_input_delay -clock clk  -max 5  [get_ports {data[2]}]
set_input_delay -clock clk  -max 5  [get_ports {data[1]}]
set_input_delay -clock clk  -max 5  [get_ports {data[0]}]
set_input_delay -clock clk  -max 5  [get_ports write_enable]
set_input_delay -clock clk  -max 5  [get_ports last_block]
set_input_delay -clock clk  -max 5  [get_ports first_block]
set_output_delay -clock clk  -max 5  [get_ports busy]
set_output_delay -clock clk  -max 5  [get_ports {digest[7]}]
set_output_delay -clock clk  -max 5  [get_ports {digest[6]}]
set_output_delay -clock clk  -max 5  [get_ports {digest[5]}]
set_output_delay -clock clk  -max 5  [get_ports {digest[4]}]
set_output_delay -clock clk  -max 5  [get_ports {digest[3]}]
set_output_delay -clock clk  -max 5  [get_ports {digest[2]}]
set_output_delay -clock clk  -max 5  [get_ports {digest[1]}]
set_output_delay -clock clk  -max 5  [get_ports {digest[0]}]
set_output_delay -clock clk  -max 5  [get_ports output_enable]
